{"userID":"E19IMURE4WEoCnvDx-bylg","reviews":[{"cool":3,"text":"Ooh definitely one of my favorite spots in vegas. Classy and modern. Each and every bar was well thought out. Within this seemingly tiny space holds a impressive number of little touches that you haven't seen from any of the other casinos on the strip. It has the charm of the boutique hotels off the strip combined with the capabilities and service of any of the top hotel casinos on the strip. \n\nShucks, even before I set foot the dang casino they were already thinking about me. The digital billboard telling you how many parking spots are available, the Shepard Fairy wheatpaste in the parking lot, cute lil green lights on the parking lot's ceilings to tell you whether a spot is open for you. I'm amazed. Then there's the DJs and performers they book. Anywhere else you're in the country you are gonna pay to see performers such as Mayer Hawthorne, Aloe Blacc, as well as DJs like Eleven and Cosmo Baker. Not at good ole Cosmo!\n\nMarquee and Wicked spoon are respectively concidered one of the top clubs and buffets in town. The theres the cool pool which overlooks the strip. By golly, these cats definitely have their $#!t together. Well to be fair, I think the only thing they have missing is a top notch vegas show, but who knows, it certainly wouldn't surprise me if they had one in the works.","review_id":"rT87ygH3-sDpZ0N0m7AdrA","stars":5,"business_id":"5LNZ67Yw9RD6nf4_UhXOjw","funny":0,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-04-16"},{"cool":0,"text":"Could've sworn I've written a review for this spot before. I've been here twice and the first time a vowed never to come here again after a disappointing time with friends dispite popping bottles here. Yeah I know. \n\nMuch of the criticism lies in the crowd which resulted in a cluster fuck where you and bae gotta be weary of the creepy drunk grab assers. Didn't really expect this at this type club but what you finna do? Secondly was the clubs' music programming. I suppose which me and the homies should've done our research because we didn't expect as much EDM (duh it's Vegas). \n\nI love EDM don't get me wrong but I love a clever mix of musical textures and definitely made some noise as a premier EDM nightclub on the strip. Love the atmospherics of dancers and acrobatics that create that sense that they surround you as you are dancing or hanging out. My second time out fared much better, and had a chill time. Opening DJ definitely got the crowd moving mixing more of a variety and definitely got the crowd movin' so by the time A-TRAK came out we were ready to have a good time! All in all I'd come back just not my first choice, this comin from a primarily hip hop/soul/rnb head.","review_id":"xfURK4K4CdYKpd2rx5wj5w","stars":4,"business_id":"NIF9q-xwMzYkmFyE2BCJDQ","funny":0,"useful":0,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2015-01-30"},{"cool":1,"text":"One of those Can't-believe-I-haven't-reviewed this place deals. Everytime I've come in they've never ceased to disappoint. I'm glad I don't have to drive as far as Spring Mountain to get me some satisfying ramen. They're always prompt and on point with their service. Their menu is pretty straightforward, no frills with a few appetizers and fried rice to get the ball rolling. Cute, casual and modern decor, the place seats probably 30 people. Tables are filled with the appropriate accoutrement Montas always a soild standby for that quick bite, casual date or getting rid of that lingering cold!","review_id":"UJyEfEc82CaHgj6I72efnw","stars":5,"business_id":"NXNa5OYmN1CNmXwHhDxpRA","funny":2,"useful":3,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2015-05-24"},{"cool":1,"text":"So I'm from Cali and gun laws are a little different here in my new home here in Vegas. Which means you get the chance to pop off a fully automatics. What a great chance for us helpless civilian folk to practice shooting at paper for a few hours to pass the time. Did some homework on a couple of the nearby ranges and decided to grab a membership here nearly half a year ago and have definitely shot my moneys worth of guns n ammo to make the difference, especially when you have the homies stroll into town, it gives us something else to do when we have some downtime in between coming off our hangover and hitting up the strip. \n\nOn top of that I plan to eventually purchase a handgun so what better way than to try out the bevy of guns they have on the rack for rental? Which by the way is free with membership. When you get the chance hop over to the other side to check out their FFL retail store so when you do figure out what it is you want on gun broker you can have that bad boy shipped over to them. If you can stand the occasional group of drunktards and d bags, spotty customer service, busy weekends, and the dude with the questionable tattoos (-1 star) then by all means getcha itchy trigger finger over here already.","review_id":"2zwAoL4OIP-STq6cGWKXKQ","stars":4,"business_id":"JcTIqoWO83FfEI9PJJHMfw","funny":0,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2010-09-07"},{"cool":1,"text":"Mmm good food from this family run business. Got in there for a UYE with me but my \"date\" (see pics, haha thanks Judd and Lynn) wasn't hungry so I ate her shrimp wonton soup. Full of flavor with no filler (ie. bok choy and char siu bits). Then I followed it up by demolishing my beef ramen. Great if you're in the area looking for Asian food. Just solid, hearty helpings with their selection ranging from Malaysian chicken curry with roti to your straight, no chaser Chinese food. However don't know if I'll trek all the way from the border of Henderson (which is where I live) to visit. I enjoyed my time there with the Yelp crew, Judd, Lynn and the owners as they were incredibly gracious and generous hosts with the TWO FOR 1 ramen bowl deal!! Yee!","review_id":"q5DTIendWGeTe3AFmnV08g","stars":4,"business_id":"1ZnVfS-qP19upP_fwOhZsA","funny":0,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-07-07"},{"cool":2,"text":"This review like a number of my other reviews is long overdue. For 4 years now Sushi Mon has been my quick, neighborhood go to spot when I'm in need of my fix. I'm literally down the street. With the exception of one incredibly gross, gut-wenching moment a few years back where me and some co-workers found a roach scrambling on our table as our waitress handed our bill, its been smooth sailing.. I'm glad because its said if you find just one of those mofos then its fairly certain theres an infestation. In this case I'm gonna chalk it up to a momentary lapse in unsanitary food practices and thankfully theres been no sight of those suckas ever since.\n\n It still gets busy during their peak times, prices are on par with the rest of them AYCE but I still fu*k with this place and the rest of the spots belonging to the Mon group.","review_id":"VnC_MrBHSirF1rr4PLjsEA","stars":4,"business_id":"7ibuDLfx8gEhESAufYIySw","funny":4,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2014-02-01"},{"cool":1,"text":"Spacious, roomy seats, the ability to purchase assigned seating ahead of time -- meaning no more having to save seats with your sweater/jacket. Shoot the chairs even recline?! They even have a stamp card for frequent theatre-goers. Gotta knock em a lil for really salty popcorn but at this point I'd be splitting hairs. Its been my theater of choice lately and have some friends driving across town simply for the quality of experience you have here.","review_id":"wLjc50UXBtIz_CtMgu1edA","stars":5,"business_id":"zoODlH40edpJYLPLkHilNA","funny":1,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2014-04-12"},{"cool":0,"text":"If you can get past all the smoke then you my friend are in for a treat. \n\nIts a cozy spot with an old vegas feel. What a dope spot to hang out, grab a great burger and beer for under $10. Tom, one of the bartenders had some classic Rat Pack playing.. NIce! They have this interesting waterwheel that's apparently been goin round n round for decades.. While it seems like they usually only have handful of people on hand and running at a bare mininum of workers, service is steady and never really skipped a beat. Live music during certain Fridays and the weekends. Last week they had Skip Martin formerly of Kool & the Gang and a jazz vocalist a few weeks ago.. but oh damn but that steak burger.. \n\nThat burger is so money.","review_id":"cfGAnfTP9kSajFBcjuSgtw","stars":4,"business_id":"UVVjnJ67fm9EbNPFK5ZgRQ","funny":0,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-03-30"},{"cool":1,"text":"Its highly unlikely you'll find fresh, hand-pulled noodles (complete with a show) outside the Las Vegas Strip or your nearby Panda Express for that matter. That combined with Beijing Noodle Cafe's prices, they can't be beat. Sure they have the typical anglicized Chinese food suspects here as well, but they obviously shine through with their noodle dishes, and boy do they hit the mark. \n\nBeijing's environment is clean but decoratively could maybe use some music and a little sprucing up but who gives a damn, this is one of the better noodle joints in town. You can clearly taste and feel the difference in texture as you take your first bite. I had a chow fun or Thai pad see ew like dish which was real good. My only complaint was that I wish our server didn't take it away before I had the chance to lick the bowl. \n\nI always hope family run places like this and Big Wong's on the Westside remain a hit as they do provide such high quality, delicious food @ incredibly reasonable prices amidst this faltering economy.","review_id":"hxWMosTws9gpqMr0K7U49w","stars":5,"business_id":"td-NOo-k4xhfVmO5X92uAg","funny":0,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-07-26"},{"cool":0,"text":"Wait, hold up 4 stars? I must have missed something. By the looks of the reviews perhaps I should've bought a Margarita. Cause while portions were more than enough to feed an army and service accommodating to our group I thought the food wasn't all that spectacular. I suppose it serves it's purpose as gringofied Mexican food. Made me miss my lengua and sesos though.","review_id":"1F7tTemZ2Fvsx_JB4ufUUw","stars":3,"business_id":"WP0M2cpWzhsMwk7kPtreRA","funny":0,"useful":0,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-02-28"},{"cool":3,"text":"I've been holding out on doing a review for a several months now just to see how they would fare after several visits and trying their sizzling sisig which was pretty good but I've had better, crispier back home in the Bay. As several other Yelpers have mentioned the portion sizes could be a tad greater on certain dishes. While food and service can be spotty and uneven at times dispite never really being crazy busy -- for the most part flavors don't disappoint, they've had a few mistakes such as their banana turon which was a little doughy and had burnt caramel then the fresh lumpia which was bland and lacking flavor. Flaws are expected with a new friends and family/ mom & pop run restaurant and can overlook them as long as they continue to bang out the more consistent, quality food they've pushed out the window. \n\nTheir place is nice bright and clean, but they can turn down the TV a bit and would love to hear some old Filipino music in the background. All and all, its good to have a former MGM and Golden Nugget chef serving up some bomb home style food right up the street from me. \n\nIf you're looking for it its in the same plaza as Sushimon, tucked away in the back of the Smiths shopping plaza.","review_id":"xeLYdvkkcXsUfdgcnxx3og","stars":4,"business_id":"-sN_og_84rLW22CaE3cjVw","funny":2,"useful":4,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2014-04-12"},{"cool":2,"text":"Refreshing! Love, love, love their shave ice which can be topped with up to 3 flavors! I usually stick to the tropical flavors and tiger's blood. But it doesn't stop there cause once you hit the bottom theres the yummy ice cream and azuki beans on the bottom! They are usually located at the fresh 52 market on sundays on eastern x serene near the border of henderson. Its always a pleasure to see the ladies, chop it up with them and grab some shave ice, winter time or not!","review_id":"-fGghpgRJXnZINxlOFTKnQ","stars":5,"business_id":"QOE93SXgKd8EsaUT-DaXhA","funny":0,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2010-12-20"},{"cool":3,"text":"Been here multiple times with the co-workers, with just a few hiccup here and there when ordering out but overall pretty consistent.","review_id":"kxjbYmR4EbXJb2a9HN6okw","stars":4,"business_id":"cOJ1uIVIHCiefUyWG2wDfw","funny":3,"useful":4,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2015-07-12"},{"cool":1,"text":"Soild 4, for all my ballers on a budget the food at this family run joint comes out quick, hot and yummy to boot! I try to make a visit when I'm nearby. I usually get the burrito with some form of Korean meat! Comes with a side of chips & dip! Nom motherf*uking nom.","review_id":"2xPeXI4PkP5JUvf-xiWkiA","stars":4,"business_id":"zdE82PiD6wquvjYLyhOJNA","funny":2,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-11-13"},{"cool":0,"text":"I'm always eager to check out their next DJ headlining or otherwise during First Fridays. Huddled up to the Griffin and across from the Vanguard Lounge, they hold a variety of themed nights and shows. Step in and there's a bar along with several booths as well as a small stage/dance floor near the DJ booth. But head to the back cause that's where its at.\n\nI cannot really comment on some of the reviewers complaints/observations of the sea of studded white belts, dbags and faux hawks everyone seems to be hawking about as I've only really been to the First Friday after parties. In my opinion its always been a dope, diverse, beautiful, laid back crowd. Second, if you can't pay a few bucks for a measly cover then head down the street or head home.","review_id":"gXB2i_ZN2PvljJMrcWpJwQ","stars":4,"business_id":"DV13F0bhe55dV1AhwoO50g","funny":0,"useful":0,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-03-23"},{"cool":1,"text":"This review is verging on a 3.5. I love the beautiful women, ambiance, diversity, oh and did I mention the lovely women? Dope plush, cushy cabanas outside, with a little pool wading area and a gambling area surrounded by the pool. So what prey tell Warren could you possibly be complaining about? Well the handful of times I've ever been there the DJ/s have played the same song twice in the span of a few hours. Big time DJ faux pas. Come on now, there are billions of songs out there, we can't be more creative? Plenty of electronic music with very little hip hop and R&B. Musically its just not really my steeze.\n\nAnd sweet baby jesus, why do they allow people to dance on the ledges? Upon my last visit our group bought bottle service by the dance floor and there were @ least 3 separate incidences where someone fell and/or spilled their damn drink on me and/or crushed a female friend as we were seated in the booth. Oof. -1.5 stars for the wack security and their inconsistent rules. It might co$t a little more and farther from the action but going in with a few friends and getting a cabana or somewhere outdoors might be your best bet.\n\nOh well, its a great place to get your fist pump on.","review_id":"FOzeStSc6IfYZoPVW3W35g","stars":3,"business_id":"MpmFFw0GE_2iRFPdsRpJbA","funny":1,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-04-12"},{"cool":2,"text":"I love this place. When you need a nice, cozy, little spot to get away and meditate over the sweeping scenes of the strip this definitely is the place to be. I enjoy taking guests here when we need to play catch up and they need a spot to hide from the strip's hustle n bustle. A little pricy for a tea but well worth it when you need some quiet time. And besides, it's in the Mandarin I expect to come outta the pocket a little when I visit any of these upscale environments.\n\nI almost wish there was some sort of quaint little stream or water fountain flowing straight through the middle of the lobby of the hotel and into the lounge just to complete the zen effect I feel going on here. Heh, wishful thinking on my part. But hey, you won't find any belligerent daiquiri-wielding drunkards and spring break revelers here. Its just you, your tea and if you want little bites of (decent) pastries. Upon my last visit, me and my then gf's mom visited and we were somewhat disappointed that the main tea room/lounge was full but the bar had just opened up so our hostess offered to seat us at the bar next door with views just as pretty as the tea lounge! Score!","review_id":"_lNrBzeNCDgY6_F57tNXgQ","stars":5,"business_id":"vYOtdnBm-45KQiiHj8jqaw","funny":0,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-04-15"},{"cool":0,"text":"Homies dig it when I bring em. Service is on point. But Insert Coins is much more than just about the video games. The owners have had the urban dance and hip hop community's back since day 1. I had the chance to watch a intimate and entertaining dance competition there the other day and chop it up/rub elbows with some of the worlds best dancers who were simply watching having a good time. Who am I kidding, where else are you gonna find a spot like this of caliber the in the country?","review_id":"ppFkKqX86cLellFRHJmqug","stars":5,"business_id":"0zeQRzpO06evIZfcR_aZ5w","funny":1,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-06-13"},{"cool":3,"text":"Anything is better than it was before they built the parking lot! Who remembers back in the day (ok so it wasn't that long ago) when there was no parking, and you had park kinda far from the sign? Then on top of that you had to precariously maneuver across the street, dodging and weaving thru incoming cars a la the Frogger video game? I do.\n\n-1 star for creating haphazard traffic on the fast lane during busy days (You locals know what I'm talmbout). They could've made the parking strip a little longer I feel.","review_id":"em8lp7sDSE-rMXuRSBK0lg","stars":4,"business_id":"ZV3G2LxpLLuZOFbn208Z5A","funny":2,"useful":3,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-04-23"},{"cool":1,"text":"Finally a decent spot to grab a bite in FE (Fremont East, act like ya know). While I argee with some of my peers that while some of the portions could be larger for some of the dishes, others are spot on. Definitely enjoy the ambiance and great for a quick, informal date or group get together. Some nights have a DJ playing usually some sexy house music and the last time I visited the DJ was accompanied by a gentleman playing the bongos, adding extra, organic touch to the music. Service can be spotty as the night progresses and tables begin to fill. My last time out I noticed a couple leaving in a bit of frustration as the were largely ignored. \n\nOverall though its 3.5 but I'm giving it the benefit of the doubt, because unless Streats is going on its sorta slim picking for us foodies in the immediate area. But in comparison to the other Thai restaurants in Vegas there certainly are better.","review_id":"4m5NdUk7ozLrlNsSZ8OOrA","stars":4,"business_id":"-ed0Yc9on37RoIoG2ZgxBA","funny":1,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-02-28"},{"cool":5,"text":"Buddha Belly is such a promising place with Hawaiian/Asian influences. I recently went for dinner during the middle of the week for dinner as I've heard only great things about it and while they were sadly out of baguettes to make their po boy and banh mi among other things it still didn't stop me from giving the rest of their menu a try. I was able to try their version of the po boy but as a wrap which was juicy and had a good amount of spice. For sides I tried their dragon fries potato salad and their house made chips which I enjoyed. One minor hitch was their 9th Island pizza which for $10 was kinda skimpy on the toppings. Throughout the entire meal the owners were great in coming over, even coming by and hooking it up with a pumpkin crunch dessert! I'll definitely be back for sure!","review_id":"j5-qjXcHN-7zmEBcAcqXWg","stars":4,"business_id":"j8pUAS0qdEcPsjkqEDNbhw","funny":4,"useful":5,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2014-10-31"},{"cool":0,"text":"The only Adidas Originals outlet store in the universe! End of story.","review_id":"wYHhxTtnYUp08a0SvzLWRA","stars":5,"business_id":"9edPSkfXKsJmkZYIaOmA7Q","funny":0,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-03-23"},{"cool":2,"text":"Definitely on par with the best of them Lost Wages burger joints.. but on wheels! Stopped by here after another shootin' session at American Shooters and just by chance met Max, who happens to be from the same culinary school I attended back home, and like the rest of us came from the bay area which made for some interesting conversation. In anycase, big up goes out to dude for making the homie something vegetarian -- on the fly! She was pretty impressed! Respect!\n\nMy other friend enjoyed his Buta-Burger while I enjoyed the Fuku Burger, which I pretty much demolished in no time flat. Proving that theres Fukin something at Fuku for everyone. I gotta try the rest of their food! Does anyone know if they have a consistent schedule or not? Twitter, their facebook or website hasn't been much help.","review_id":"jSGYpnqtW8NHpAx2XsxsgA","stars":5,"business_id":"ydcNlRMKs93AQpOhVkSrGQ","funny":0,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-04-19"},{"cool":1,"text":"This review is for pick up only. \n\nWhat's going on here? This local chain seems to be spreading themselves thin. I've been to their other location on the eastside and found their pizza to be just okay.. But damn those garlic knots were tough as rhymes with (hockey) puck.. Pretty sure they were old. \n\nTo top it all off, according to the girlfriend, they were rude up front and too preoccupied with their cellphones to give a damn. Eh, it's all good though cause we need establishments such as these to remind us of good food and service when we see it.","review_id":"x7ijmfsd4qA2g3rcgYuFIA","stars":1,"business_id":"k2b3niokS_tosjah_rzCPw","funny":1,"useful":5,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2014-04-12"},{"cool":1,"text":"Their oysters scuur me dearly. You're better off at an AYCE spot pretty much anywhere around town than their stuff thats been kickin it under the sneeze guard all day... Just sayin!","review_id":"gtjWoqOaIr_9YoJTx22nGQ","stars":2,"business_id":"XgsIf7s2zM-cC29WUD-NZQ","funny":0,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2015-05-24"},{"cool":0,"text":"Being a hip hop head I'm already gonna be biased and your opinion can get pretty skewed even when you got in for free. But either way, when you get a good handful of the freshest b-boys in the world combined with the elements of a Cirque show, complete with action, suspense and some tongue in cheek humor and comedic romance (?), you have yourself a damn good entertaining night. \n\nSure some of the production values could use some work particularly a few of their props and the slightly corny outdated CGI used in the show but make no bones about it you won't find strings or \"magic\" wires lending a helping hand here. Just pure, raw, physical talent from some of the worlds illest dancers out there. The creation of this show at the mainstream casino Monte Carlo just sort of exemplifies the seemingly ubiquitous b-boy scene out here that only rivals that of NY SF and LA.. But any of the aforementioned towns don't have a show that comes close to what these cats are doing ON THE DAILY BASIS. Respect to the homie and San Jose native, DJ Cutso of the Bangers Crew who worked on a fairly good chunk of the musical production of the show.. Haha like I said could I be anymore bias with this review?\n\nOkay one minor quip then -- I think an interesting addition to the show would maybe be sexy b-girl, female addition to the group.. Does anyone have Asia-1's number?\n\nA guy can still dream can't he?","review_id":"475CXg6MT16m6uxeIG9A_A","stars":5,"business_id":"o597EK6uvR5RuPMZEwYCUg","funny":0,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-04-27"},{"cool":0,"text":"So I've been looking for a hole in the wall or a spot to grab a quick bite near the CSN Charleston campus during my lunch breaks. Looks like I found it! Ordered some strips with the wasabi sauce. Bomb. Dig. Nice panko style breading, thin crunchy fries, nice customer service from the asian brother (owner?) and the options of sauce as well the preparation of your chicken: grilled, baked or my personal favorite fried.. Definitely the go to spot if I'm craving some cheap eats. \n\nI think its about time we get rid of these corporate chicken chains or other fried chicken spots with their food chillin up under those heat lamps all dang day. Don't you?","review_id":"ardEt_jGX_zQXcSHCMIlpw","stars":5,"business_id":"wX1ORSDKPkA5ftE7F6UONw","funny":0,"useful":0,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-03-23"},{"cool":2,"text":"Been here once, didn't stand out to me seemed like typical run of the mill pizza spot. Seems like a good place to take the family or groups.","review_id":"fvHpcF-Nen7o2DK-G-i4OQ","stars":3,"business_id":"Gen0ei06dGq13OJ8DRXUjg","funny":1,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2014-02-01"},{"cool":2,"text":"Good deep dish pizza, however I've had better -- Giordanos in Chicago and Zachary's in the Bay Area, California. I would go back since they are literally down the street from me. However they've messed up our orders on 2 separate occasions, not cool since my GF is allergic to certain things.. \n\nSorry guys I won't be going back and will try some of the other Chi-town deep dish pizza alternatives in Vegas.","review_id":"9tMAGPZDtA67bLwRCVF3og","stars":3,"business_id":"dGuVYsA5DMCm_TjSbX6x7g","funny":2,"useful":4,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2013-07-03"},{"cool":1,"text":"5 things that go through my head when I visit.\n\n1. Presh pried pish prom Philipino polks. \n\n2. Ahhhhhh I feel like I'm in Daly City again. Win.\n\n3. M u s t..  r e f r a i  n.. from.. picking up multiple packages of dried squid, mango..\n\n4. Dude, where else am I gonna find fresh coconut and lychee on this side of town? \n\n5. Hmm.. What am I gonna buy from Valerios when I'm done with this place?","review_id":"wRYujYq1p5h4AOohCHsAyQ","stars":5,"business_id":"9XelmxS5q9tv7uClvjGqMg","funny":2,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-01-07"},{"cool":2,"text":"Lets be clear: Prices have seemingly gone up and service isn't what it used to be. Just looking at the higher reviews on this page and you find the period in which their 4/5 stars begin to taper off. \n\nJust sayin'.\n\nCould've sworn I'd reviewed this place in the past.. If I did it would've received a 5 star rating easily. I suppose really didn't feel the need to at the time, considering it held and deserved it's high 4/5 marks on Yelp as a great breakfast spot pretty deep in Anthem for a while.. up until now. It's not that they serve terrible food. I'm sure they still have pretty decent breakfast/brunch/lunch options.. I'd just say chalk this place up as a place that many Yelpers used to frequent but haven't updated their review recently. \n\nIn anycase, I've only been here once since the original owner, Chris left Vegas and his meat and three spot closed down a few stores over. I really loved the place prior to him leaving I'm not sure I feel the same way about the place after his departure. \n\nBeing in the culinary industry myself along with his ties to the bay area, I was able to share some great conversations with him about food politics, life and some great concepts and ideas. He would even help fellow budding restauranteurs/entrepreneurs by providing a place for food trucks to set-up shop in front of the restaurant, as well as food truck battles to take place and even a pop up restaurant... within his own business! \n\nTo find out such a forward thinking, visionary -- especilally in this town is gone is a bit disheartening and upon my last visit B&B sadly seems like a ghost of it's former/original owner.","review_id":"2gWoWsfTjEjAxEY_jqGbSg","stars":3,"business_id":"3b94MZ9agaZL8SMBagTwpA","funny":2,"useful":6,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2013-12-28"},{"cool":2,"text":"Being from the Bay Area I regret not visiting its sister restaurant in SF. So, I finally decided it was the perfect time to check Fleur de Lys out once and for all.. this was a few months ago.\n\nOverall me and my date both agreed that everything was fine but simply lacked that \"umph\" that I'd expect from a chef of Keller's caliber to do and take us over the edge. Sorry but I gotta chalk it up as (what was) another overpriced spot along the strip. The execution was fine, but maybe its the fact that Vegas can't quite grow the best of ingredients/produce that money can buy. If thats the case my money will go elsewhere.\n\nWith the current state of the economy, more and more chefs are having to tweak their formulas and re-tool their restaurants. Seems like Mr. Keller agreed that Fleur de Lys was one of them as it's recently shut down temporarily until later in the year and will reopen as a tapas restaurant. Good luck Mr. Keller!","review_id":"GpkrT7lgxyNOYhcQ5jCaaA","stars":3,"business_id":"YuiM5VKscO8rS1EX7f19_g","funny":1,"useful":5,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2010-09-15"},{"cool":1,"text":"My favorite local hideout since moving away from the bay, I suppose it's Nevada's version of Ameoba, Streetlight or Rasputin records. New used records and dvds! I'm fu*kin sold! They also carry magazines, tees, novelty items, books, games, and on occasion artist signings/performances. Most definitely an audiophile or music geek's place to kick it. Be sure to bring a member card (and a wad of ca$h). Oh and good luck trying to find my hidden stash of the good records I hide for myself when I go back for a return visit.","review_id":"iRyIgnhxFuQtrZSzhxT26w","stars":5,"business_id":"bOJXwHQshIQJLJa1kqVZIg","funny":0,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2010-12-21"},{"cool":2,"text":"Been here about five times and have never been dissappointed. Gotta big up the homie Tien N. for recommending the Spicy Beef.. so money. I usually get the honey walnut shrimp but is usually one of the those things you just gotta eat there or shortly after because after that the flavor and even moreso the texture of the faux shrimp becomes more prevalent. Asian style decor and ambiance is cozy with faux fountain and birds to go with your faux meat to boot! \n\nService is typically on point and welcoming. Probably my only gripe is the prices of the joint as I was spoiled with the numerous, tasty but cheap ones back home in the Bay Area. Veggie House knows that they're probably the best at their job in doing the Chinese faux meat thing here in Vegas so I reckon they feel they can command the prices they do. All in all I recommend this place for those looking to give their digestive tract a bit of a break, veggie lovers and those skeptical of the wonders of faux meat/texturized soy protein. Come with an open mind and don't knock it till you've tried it then realize you just reduced that carbon footprint of yours.","review_id":"Egn5cSwTr8xwDTyhvAVCUA","stars":5,"business_id":"AtD6B83S4Mbmq0t7iDnUVA","funny":4,"useful":5,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2014-04-12"},{"cool":1,"text":"Been here a few times to Orchids, and out of PPP, Changs Cathay House and KJ, I've probably enjoyed their wu gok/fried taro dumplings the best. They have all the usual dim sum items here -- but that fried taro dumpling is basically my litmus test for a good dim sum spot. At Orchids their dumpling was warm with a good ratio of filling-to-dough ratio, it wasn't too greasy or had that soaked up that nasty oil flavor from incorrect frying temperature, and still had that lovely crunch and flakiness on its outer layer. \n\nNothing to write home to mama about, its solid/on par for Vegas dim sum standards, 3.5 stars rounding up. It might be out of my way but it's still worth the drive when me and my guest(s) need to eat our way through a hangover in the morning. Like any other decent dim spot arrive early or expect to be waiting a while on the weekends.","review_id":"U_p1EthsEhwna2c5eiF9Hg","stars":4,"business_id":"Jur1iiejUFw_YCkfDfy1gQ","funny":1,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2013-02-11"},{"cool":0,"text":"Where in Vegas can the beautiful soulful, deep house heads seek refuge? \n\nLook no further than Cocktail Room. Man, this place is one of my favorite lounges. Its classy, dark, sleek, romantic but unpretentious. I enjoy taking people here that aren't familiar with what East Fremont has to offer as they typically have those preconceptions of being run-down and dilapidated. At DCR you'll find creative seasonal cocktails and a fairly diverse crowd. While there really is no dance floor to practice your latest house dance moves, on busier nights impromptu mini-dance floors may appear as the night progresses and DCR's strong drinks begin to take effect.\n\nHead towards the right side of the bar and you'll find some semi-private, plush little booths with these dope chandeliers -- for those more cozy, intimate rendezvous ahem*wink*wink*nudge*nudge* The last time I visited it was a windly, cold and wet Thursday which I'm sure scared people off and there was no DJ. Typically Fridays and the weekends are definitely the best times to visit. Good luck finding a seat during summertime tho. And if its First Friday then fuggetaaboutit. One small knock -- service can be lax at times and its lack of light may make it hard for the waitress to see, but no excuses from me. Still, its a great place to kick it and hang out.\n\nDCR was listed as one of Food & Wine's \"50 Best Bars in America\" list. \nhttp://www.foodandwine.com/slideshows/americas-best-bars","review_id":"N9CLY_c1t1j0KSpNqW1VYA","stars":5,"business_id":"2UgRg5a6KmpbD_SZfhNrKg","funny":0,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-12-12"},{"cool":0,"text":"Rushed us out at exactly 9:30. Owner or owners son awkwardly stared at us the whole time. Mad dogging us. Been going there for quite sometime. Wanna support the Mom and pop shops but can't justify it with horrible service","review_id":"B3kn51F0Rqbpgti_F1u0rA","stars":1,"business_id":"FSnqO-YWUdRb0Xc95nXbvw","funny":3,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2017-02-02"},{"cool":0,"text":"Close to the strip and work, me and a few friends stopped by after work on sunday to grab some nachos, drinks and watch what else but football. Pretty decent mixed drinks enjoyed my time there and hot damn them nachos are certainly a force to be reckoned with. Its probably enough to feed 3 people so be hungry. I didn't try any of the entrees but hey if the nachos are good enough for the 2 mexicans I rolled with then its good enough for me. Not bad for a stop for mexican food on the strip.","review_id":"sS7sV9UQDOWfZqj-nry0pg","stars":3,"business_id":"0AQnRQw34IQW9-1gJkYnMA","funny":0,"useful":0,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2010-12-20"},{"cool":1,"text":"It certainly is a different burger than that of In N Out. But whether Five Guys provides a better burger for it's price range is debatable. I'm still trying to figure out what the gleaming reivews here are for. One bite and like some have critized, reminded me of a burger from Wendy's. The burger has some pretty good heft and comes with a variety of options that come for free tho.\n\nYou get a pretty good portion of steak fries in a cup, I'd say enough for 2 in fact, but maybe managers should tell the high-schoolers to monitor their temps on the fryolator a wee bit better cause the huge deal breaker for me were the poor, limp, oily \"Cajun\" fries in a cup. Hell, maybe add a Sixth Guy. What good are the fries when they're soggy from the gate?\n\nI would've liked a shake or some type of beverage exclusive only to Five Guys to wash down my food down aside from the usual fountain drink suspects. So maybe they were having a bad day on a slightly packed Thursday evening. I'm willing to give them another shot, they certainly didn't do any wrong but didn't knock my socks off either.","review_id":"H3AXIjMMTQt04F3NXR3fFg","stars":3,"business_id":"L877pDtfa3FyN0fcNeCdlA","funny":1,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-04-30"},{"cool":5,"text":"Came by here for the second time late last nite after a night of a bit of First Friday Fremont Street hi-jinx with some of the co-workers and needed something to handle that buzz. Decor is on par with the typical Chinese restaurant standard with crustacean and fish tank on the right side -- to emphasize that it is in fact a Seafood Garden.\n\nJokes aside, I'd bypass the Pho Kim Long and head here for the cheap Chinese eats, with less grease than that other late night Chinese spot directly across the street whose name escapes me (below Ichiza). Me and my GF picked up 3 pretty decent vegetarian friendly dishes: fried rice, spicy eggplant tofu and vegetarian delight -- clocking in under $25. \n\nFirst time around as a pre-Las Vegetarian I recall ordering plenty of meat and seafood dishes with a few other heavy hitting Yelpers. This is where HK Seafood Garden shines. Its one of those places for you and a gang of folks to order some Chinese food favorites, chow down, share some laughs while recapping your night of debauchery and bounce. Throw in a \"reverse happy hour\" - which includes anything in their lunch menu and you have a great place to take care of your lil head change.","review_id":"FuVs62XNlRO0fdQkJcySPA","stars":4,"business_id":"9sbXPpRC_wDhCsp7qG2PDw","funny":2,"useful":3,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2013-06-08"},{"cool":0,"text":"Came by via Nelson's UYE/B-Day and had the kalbi with 2 sides which had good flavor, nice little char along with the traditional mac salad and a huge side of salad. Had some of the fellow Yelper's poke and it was all pretty good. As you would expect at a Hawaiian joint, there were tremendous portions, I took nearly half my meal home. Pretty much the only concern I had was the heavy mayo like dressing for the salad and a couple of complaints of other Yelper's katsu and roasted pork being (and looking) pretty dry other than that, I don't mind heading back here again. 3.5 rounding up.","review_id":"BXnF76V34_t6uvUOG7v2jQ","stars":4,"business_id":"uW6UHfONAmm8QttPkbMewQ","funny":0,"useful":0,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-07-25"},{"cool":2,"text":"Took em down a star for their rude azz f*ck pushy attitudes behind the counter. I told you already, I don't want them old azz lumpias that been sitting there all day! Sheesh.\n\nSince Kucina Ni Lorraine Express opened up on Bermuda I've been taking my azz there instead lately.","review_id":"1jnPEu7X7vdEy239n2-Fnw","stars":3,"business_id":"UwXOqtr0LCoWsGXP96fOuQ","funny":8,"useful":7,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2014-02-14"},{"cool":0,"text":"Ok so, bumping you back up. My friends dig it and I very much enjoy your sangria, warm vibes and company Firefly. But don't think for a second you can take my love for granted and start slippin' on me again.","review_id":"GUwkSuw-R64bQ4ikg0n_0g","stars":4,"business_id":"5shgJB7a-2_gdnzc0gsOtg","funny":0,"useful":0,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-05-26"},{"cool":2,"text":"Independent coffee shop THAT SELLS BEER & RECORDS. Oh my damn. \n\nI could've sworn I've passed this by before. I should've known better from all the music and art related posters plastered all along their windows. This humble, unassuming coffeehouse should have a sign outside in bold for geeknerds like me that reads: \"BEER, RECORDS & ART\". Armed with a cool collection of 45 and LPs ranging from jazz, rock, soul and a little world and hip hop -- modestly priced, with mostly originals with a chunk of represses. Listening station even. There's also posters and postcards for sale as well. My iced chai was simply ok. I've had much better and I don't know about their coffee or food which mainly consisted of sandwiches and wraps but I'm willing to go back again (and again) to check it out when I'm back in the area (soon).\n\nBe sure to check out Human Experience, one of LV's best open mic nights every Monday from 7 till about midnite, usually backed and hosted by LVs finest DJs on the wheels of steel..","review_id":"cU-j7Pl1tQHuiV0A3nfq3Q","stars":5,"business_id":"Xspg78dOvuedvuPEUwZBjw","funny":0,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-05-10"},{"cool":1,"text":"Again a solid meal last nite. Me and my date ordered the pickled veggies, salt & pepper fries, truffle fries, Kiki and Mr. Ho. She loved the Kiki and truffle fries, but wasn't used to the medium rare flavor of beef-pork patty in the Mr. Ho. Service was attentive.","review_id":"5_D69ltK3BYDKph-AMmT0w","stars":4,"business_id":"7sPNbCx7vGAaH7SbNPZ6oA","funny":1,"useful":1,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-01-14"},{"cool":0,"text":"Aww. Gotta bump you down JS. Somewhat of a letdown for a handful of out of town guests who had enjoyed their time at Firefly. Mussels were tiny, wasn't feeling the foamy presentation of the pork belly dish (hello Goyemon!) and tried a few other dishes which were fine. Still, service and white wine sangria is still on point just don't think I'm coming back for a while.","review_id":"CxSyQ0mkIkmhP1i8FILdMw","stars":4,"business_id":"_w5hBpkjHs5_Hv3pLeHtIw","funny":0,"useful":0,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-03-30"},{"cool":1,"text":"Wow, how could I have missed writing about one of my favorite places in the omniverse?\n\nOnce upon a time before the Xboxes, Playstations, IPhones, Guitar Heroes, and digitally mowing down people with your G35 rifle there were these weird boxes that spit out metal balls and you'd try to do your best to preserve it by hitting it with \"flippers\". Funky stuff. Welcome to a pinball lovers dream come true. Even if you aren't just into the pinball thing don't fret, there's still classic (circa 1980) video games here to be found plus there are so many special different themed pinball games that there HAS to be one that just beckons for your every quarter..","review_id":"px9NS9G0AFOEXJg1cTYuoA","stars":5,"business_id":"8mIrX_LrOnAqWsB5JrOojQ","funny":1,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-04-13"},{"cool":2,"text":"I've been craving some quality pastrami for a few weeks now and decided after work to hungrily roll up to Sammy's excited to check what this tiny shack on Durango x Flamingo has to offer.. I ordered some pastrami garlic fries and the homie/coworker ordered the pastrami burger. After eating our meal me and my coworker were pondering whether to get something else to eat elsewhere after eating our food. We contemplate heading back to work to eat at employee dining even. Haha. Portions were mediocre by Las Vegas standards. Highlight was probably the Pomegranate slushie drink. It trys to serve diner food minus the diner experience and service but the food ranks slightly above the mainstream fast food chains that similarly serve the same type of food. But! At the very least, if you're gonna have pastrami in your name, your pastrami game better be tight and live up to the hype! Which alas, it doesn't. Sort of bland and flavorless. I'm kinda sad, I had high hopes for you Sammy's. I was expecting you to be something like the Hat's (out in Los Angeles) little brother. Ah well.","review_id":"pb29h-9PQ15AIFid9hEKOg","stars":3,"business_id":"oYPpWHgsjcIt-tUzGXk_eA","funny":1,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2011-04-15"},{"cool":1,"text":"I've only been here when friends from outta town insist on stumbling through the Planet Hollywood to handle our post club grub, all of us at various states of public drunkenness looking for a place to wind down the nite.. or real early morning.\n\nI don't necessarily understand what the hype is about surrounding these sandwiches. But I'm thinking one of the main reasons its so popular is because of the lack of places to eat on the Strip that don't break the bank. I appreciate the variety of flavors and influences on top of the more traditional sandwiches on the menu. Plus I like the idea of healthy options available @ 3am. However! Two nites in a row at around 3 or 4am-ish they were resetting their systems. Why? When you know you're about to get a huge rush of hungry belligerents coming after you? No bueno. \n\nFrom what my hazy memory can recollect, all the sandwiches I've had and taken random bites from have been consistently solid, hot and tasty. Good enough for me. Everything tastes like your eating sweet ambrosia picked from Athena herself when you're toasted/FUBAR anyhow.","review_id":"xhMl7X0IPHK_w8cQj4ZGZg","stars":3,"business_id":"DkYS3arLOhA8si5uUEmHOw","funny":0,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2012-01-07"},{"cool":2,"text":"Alright ok, once you and your glazed weary eyed friends gotten over the name of the place, you'll find that this is a pretty decent spot to go if you're looking for that late nite, post-clubbing hangover cure as I'm sure many people know by now. \n\nGreat for drunken stumbling groups or for just you and a homie/lover/friend. I've been here a good handful of times through a span of 4 years now -- typically when friends are visiting and while their food may not be the greatest Viet spot in Vegas, they make up in their hours and the variety of traditional Viet-Chinese pho and rice dishes. Upon a recent visit I met up with a group of friends that never been to a Vietnamese-Chinese spot and all of them for the most part enjoyed their food. For that they teeter along a 3 and 3.5 in my book but I prefer to round up and give these businesses the benefit of the doubt!","review_id":"U_2tC3Ch__tOV3Radd2FWQ","stars":4,"business_id":"yfxDa8RFOvJPQh0rNtakHA","funny":2,"useful":2,"user_id":"E19IMURE4WEoCnvDx-bylg","date":"2013-12-28"}]}